lib/holiday-stops/src/test/resources/WeekendVoucherSubscription.json

{
  "success": true,
  "id": "2c92c0f96d674baf016d67ace37d3642",
  "accountId": "2c92c0f96d674baf016d67ace32d363a",
  "accountNumber": "A00024530",
  "accountName": "0013E000015OvivQAC",
  "invoiceOwnerAccountId": "2c92c0f96d674baf016d67ace32d363a",
  "invoiceOwnerAccountNumber": "A00024530",
  "invoiceOwnerAccountName": "0013E000015OvivQAC",
  "subscriptionNumber": "A-S00051833",
  "termType": "TERMED",
  "invoiceSeparately": false,
  "contractEffectiveDate": "2019-09-25",
  "serviceActivationDate": "2019-09-25",
  "customerAcceptanceDate": "2019-10-26",
  "subscriptionStartDate": "2019-09-25",
  "termStartDate": "2019-09-25",
  "termEndDate": "2020-09-25",
  "initialTerm": 12,
  "initialTermPeriodType": "Month",
  "currentTerm": 12,
  "currentTermPeriodType": "Month",
  "autoRenew": true,
  "renewalSetting": "RENEW_WITH_SPECIFIC_TERM",
  "renewalTerm": 12,
  "renewalTermPeriodType": "Month",
  "contractedMrr": 20.76,
  "totalContractedValue": 227.69,
  "notes": null,
  "status": "Active",
  "TrialPeriodPrice__c": null,
  "QuoteNumber__QT": null,
  "OpportunityName__QT": null,
  "GiftSubscription__c": "No",
  "LastQSSPaymentDate__c": null,
  "TrialPeriodDays__c": null,
  "CreatedRequestId__c": "e5171388-36e5-5939-0000-000000014a35",
  "ActivationDate3__c": null,
  "AcquisitionSource__c": null,
  "CreatedByCSR__c": null,
  "CASSubscriberID__c": null,
  "LastPriceChangeDate__c": null,
  "InitialPromotionCode__c": null,
  "Suspended__c": "false",
  "CpqBundleJsonId__QT": null,
  "QuoteType__QT": null,
  "QuoteBusinessType__QT": null,
  "SupplierCode__c": null,
  "AcquisitionCase__c": null,
  "ReaderType__c": "Direct",
  "ActivationDate__c": null,
  "UserCancellationReason__c": null,
  "SuspensionStatus__c": "Active",
  "CardCountry__c": null,
  "OpportunityCloseDate__QT": null,
  "IPaddress__c": null,
  "IPCountry__c": null,
  "CancelledBy__c": null,
  "dummy__c": null,
  "PromotionCode__c": null,
  "OriginalSubscriptionStartDate__c": null,
  "LegacyContractStartDate__c": null,
  "CancellationReason__c": null,
  "ratePlans": [
    {
      "id": "2c92c0f96d674baf016d67ace3b23648",
      "productId": "2c92c0f8555ce5cf01556e7f01281b7e",
      "productName": "Newspaper Voucher",
      "productSku": "SKU-00000035",
      "productRatePlanId": "2c92c0f8555ce5cf01556e7f01b81b94",
      "ratePlanName": "Weekend",
      "ratePlanCharges": [
        {
          "id": "2c92c0f96d674baf016d67ace3b73649",
          "originalChargeId": "2c92c0f96d674baf016d67ace3b73649",
          "productRatePlanChargeId": "2c92c0f8555ce5cf01556e7f01cb1b96",
          "number": "C-00057518",
          "name": "Saturday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP10.56",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 10.560000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "ChargeTriggerDay",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-26",
          "effectiveEndDate": "2020-09-25",
          "processedThroughDate": "2019-10-26",
          "chargedThroughDate": "2019-11-26",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.560000000,
          "dmrc": 10.560000000,
          "tcv": 115.819354834,
          "dtcv": 115.819354834,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        },
        {
          "id": "2c92c0f96d674baf016d67ace3bc364a",
          "originalChargeId": "2c92c0f96d674baf016d67ace3bc364a",
          "productRatePlanChargeId": "2c92c0f8555ce63a01556e81e4a86077",
          "number": "C-00057519",
          "name": "Sunday",
          "type": "Recurring",
          "model": "FlatFee",
          "uom": null,
          "version": 1,
          "pricingSummary": "GBP10.2",
          "priceChangeOption": "UseLatestProductCatalogPricing",
          "priceIncreasePercentage": null,
          "currency": "GBP",
          "price": 10.200000000,
          "tiers": null,
          "includedUnits": null,
          "overagePrice": null,
          "discountPercentage": null,
          "discountAmount": null,
          "applyDiscountTo": null,
          "discountLevel": null,
          "discountClass": null,
          "discountApplyDetails": [],
          "billingDay": "DefaultFromCustomer",
          "listPriceBase": "Per_Billing_Period",
          "billingPeriod": "Month",
          "specificBillingPeriod": null,
          "billingTiming": "IN_ADVANCE",
          "billingPeriodAlignment": "AlignToCharge",
          "quantity": 1.000000000,
          "smoothingModel": null,
          "numberOfPeriods": null,
          "overageCalculationOption": null,
          "overageUnusedUnitsCreditOption": null,
          "unusedUnitsCreditRates": null,
          "usageRecordRatingOption": null,
          "segment": 1,
          "effectiveStartDate": "2019-10-26",
          "effectiveEndDate": "2020-09-25",
          "processedThroughDate": "2019-10-26",
          "chargedThroughDate": "2019-11-26",
          "done": false,
          "triggerDate": null,
          "triggerEvent": "CustomerAcceptance",
          "endDateCondition": "Subscription_End",
          "upToPeriodsType": null,
          "upToPeriods": null,
          "specificEndDate": null,
          "mrr": 10.200000000,
          "dmrc": 10.200000000,
          "tcv": 111.870967737,
          "dtcv": 111.870967737,
          "description": "",
          "HolidayStart__c": null,
          "HolidayEnd__c": null
        }
      ],
      "subscriptionProductFeatures": []
    }
  ]
}